{
    "data": {
        "1": {
            "timeline_id": "1",
            "timeline_lable": "DAY 0",
            "timeline_day_lb": "0",
            "timeline_day_ub": "0",
            "timeline_set": {
                "1": [
                    "Welcome to NoBeep and congratulations on taking the first step towards your recovery journey!",
                    "Visualize how you will feel when you reach the end of this path - overcoming your addiction and reclaiming your freedom. Now that's something to be proud of! "
                ],
                "2": [
                    "Scroll down ⬇️ to find a list of curated videos designed to help you for your recovery."
                ]
            },
            "youtube": [
                {
                    "video_id": "9qJHRvHU8IM",
                    "video_title": "Andrew Huberman - How Porn Addiction Destroys Men’s Brains",
                    "video_author": "Chris Williamson"
                },
                {
                    "video_id": "d1v170oM67U",
                    "video_title": "What Happens When You Quit Porn?",
                    "video_author": "AsapSCIENCE"
                },
                {
                    "video_id": "nSRPXLuayLQ",
                    "video_title": "The Sad Reality of Modern Men",
                    "video_author": "SANQ4"
                }
            ]
        },
        "2": {
            "timeline_id": "2",
            "timeline_lable": "WEEK 1",
            "timeline_day_lb": "1",
            "timeline_day_ub": "7",
            "timeline_set": {
                "1": [
                    "The Timeline is here to help you power through the journey of recovery. You are advised to gradually replace unhealthy habits with healthier ones, such as exercising, volunteering, and more.",
                    "As you progress through the challenge, you'll abstain from watching porn, masturbating, or masturbating to porn for an extended period of time. This gives your mind and body a chance to reset, so porn and masturbation no longer take precedence in your life.",
                    "The length of this timeline will vary depending on the individual."
                ],
                "2": [
                    "Day 1 – Today marks the beginning of a new journey. Let’s take it one step at a time. 🚀 You may feel motivated and empowered by your decision to make a change, but it’s natural to feel a bit of anxiety too. Don’t overthink it and remember – you got this! ",
                    "Day 2 – On day two of your challenge, you may experience strong urges to view porn. 📵 Don’t worry – this is normal! Your body is detoxing from the extra hormones/neurotransmitters that were released when you watched porn or masturbated. 🧪 Just remember, these urges are only temporary and will go away the longer you complete the challenge.",
                    "Day 3 – Good news – you should start to notice some positive changes in your energy and health on day three. 💪 You might feel more focused, self-aware and motivated than before. Keep it up!",
                    "Day 4 – This day may be tough, with strong urges to watch porn. 🚫 But don’t worry – you have the power to fight them! 💪 Even if you slip up, it’s all part of the journey. Pick yourself up and keep going – you can do it! 💯",
                    "Day 5 – The fifth day of the NoBeep Challenge is a crucial step in your recovery journey. You've likely noticed an improvement in your health since you've started, but you should also be aware that this challenge will require a lot of effort and dedication. Your willpower is like a muscle that can be strengthened or weakened depending on how you use it",
                    "Days 6 & 7 – For most recovering people, the weekend can make staying on track a challenge and days sixth and seventh days fall on the weekend. With so much free time and no work or school to distract you, it can be easy to slip back into old habits. It's important to remember that if you relapse during this time, you'll have to start the challenge over from the beginning."
                ],
                "3": [
                    "Things may be easier in the mornings when you're feeling the most motivated, but your willpower can easily decline as the day passes. Fighting your triggers and urges while they're at their strongest can be difficult, so it's important to stay vigilant.",
                    "Make sure to plan ways to stay busy and distracted from the temptations of pornography. Spend time with friends, go for a walk, or take on a hobby that will help you stay focused on your recovery. With a little bit of planning, you can get through the weekend and stay on track."
                ],
                "4": [
                    "The benefits of week 1 may include: ",
                    "Feeling more energized and refreshed due to improved sleep patterns",
                    "Increased motivation to stay productive and complete tasks",
                    "A newfound attraction to others that is not driven by addiction",
                    "A heightened focus on achieving your goals and dreams",
                    "You may experience wetdreams in this week or the next."
                ]
            },
            "youtube": [
                {
                    "video_id": "3iD-_dLn5Xk",
                    "video_title": "My 1 Year Transformation",
                    "video_author": "ICEcold JT"
                },
                {
                    "video_id": "mhO4jV9WCII",
                    "video_title": "What will you become?",
                    "video_author": "Lazy Square"
                },
                {
                    "video_id": "3onkCpQ6JAU",
                    "video_title": "NOFAP & WET DREAMS?! - Why They Happen & What To Do.",
                    "video_author": "Self-Developed"
                },
                {
                    "video_id": "i6gk4lW1hPo",
                    "video_title": "Part 1-5: Your Brain on Porn",
                    "video_author": "FreeMedEducation"
                },
                {
                    "video_id": "ayjQ5MvSMYU",
                    "video_title": "Part 6: Numbed Pleasure Response | Your Brain on Porn",
                    "video_author": "FreeMedEducation"
                },
                {
                    "video_id": "bC_529ScXeM",
                    "video_title": "Part 7: The Binge Mechanism | Your Brain on Porn",
                    "video_author": "FreeMedEducation"
                }
            ]
        },
        "3": {
            "timeline_id": "3",
            "timeline_lable": "WEEK 2-3",
            "timeline_day_lb": "8",
            "timeline_day_ub": "21",
            "timeline_set": {
                "1": [
                    "This is the stage where you'll need to fight cravings and urges to go back to old habits. Although it may seem like a daunting task, it can also be a rewarding journey",
                    "You'll find that your energy level will increase and your productivity will improve. This is the stage where you can start to feel empowered and uplifting. So stay committed and keep pushing forward!"
                ],
                "2": [
                    "Days 8-14 – During this time, you may experience strong cravings to engage in porn-related activities, such as viewing pornography, masturbating, or masturbating to porn. Remember that these cravings are only temporary and will eventually pass. This is also a good time to recognize improvements in your relationships and friendships.",
                    "Days 15-21 – It's very likely that beginning to enjoy some of the mental and physical benefits. Keep up the good work and stay focused on your goal!"
                ],
                "3": [
                    "The second and third weeks of your recovery can bring some exciting changes! Here are just a few of the benefits you may experience:",
                    "A decrease in feelings of guilt, shame, and anxiety.",
                    "A better understanding of yourself and your triggers.",
                    "These changes can help you get one step closer to a healthier, happier life. Take the time to focus on yourself and your recovery journey and don’t be afraid to reach out for support if you need it."
                ],
                "4": [
                    "During Stage 2, you may come across something called a 'Flatline'. In this phase, you may experience a dip in energy levels and may feel mentally and physically drained. It's likely that you won't feel your typical urges or cravings for porn or masturbation. This is a natural part of the recovery process.",
                    "During this time, you may experience a range of withdrawal symptoms, such as numbness, depression, apathy, and a lack of interest in activities and people.",
                    "The length and intensity of the flatline can depend on a variety of factors, such as the age you started watching porn, the type of porn you watched, and the length of time you were addicted for.",
                    "One possible explanation for the flatline is that your brain is deprived of the euphoric chemicals that were released during orgasm. This can be a difficult time for those recovering from addiction, but it's important to remember that these feelings are only temporary and that there is hope for a better future."
                ]
            },
            "youtube": [
                {
                    "video_id": "rXfZwNqVDVA",
                    "video_title": "The FLATLINE: Everything You Need To Know",
                    "video_author": "The Reboot Nation"
                },
                {
                    "video_id": "NO8Fz6gGOus",
                    "video_title": "HOW TO BREAK THE BAD HABITS - Try it and You'll See The Results",
                    "video_author": "Be Inspired"
                },
                {
                    "video_id": "nj6G2_OiviQ",
                    "video_title": "9 Reasons to Take Cold Showers Everyday",
                    "video_author": "Gravity Transformation - Fat Loss Experts"
                }
            ]
        },
        "4": {
            "timeline_id": "4",
            "timeline_lable": "WEEK 4-6",
            "timeline_day_lb": "22",
            "timeline_day_ub": "42",
            "timeline_set": {
                "1": [
                    "Now is the time to commit to a healthier lifestyle and find peace within yourself. It won’t be easy, but with dedication, you can make progress towards recovery.",
                    "Start by reflecting on why you have been using porn and/or masturbating and what you can do to break the cycle. Acknowledge and accept the fact that you have engaged in these behaviors and that it has been a detriment to your overall wellbeing. Once you have done this, start to take small steps forward in the process of recovery.",
                    "Your timeline for recovery will depend on how dedicated you are and how quickly you can move away from these unwanted habits. You can expect to experience a rollercoaster of emotions as you break free from the shackles of addiction. But, with patience and a positive attitude, you will be able to make progress and eventually reach a place of clarity and peace. 🙏"
                ],
                "2": [
                    "Days 22-28 – You’re progressing well in your NoBeep Challenge and the urges to view porn and/or masturbate may be getting more intense. Don’t worry – these urges will lessen with time as you continue your challenge. You may also find that your relationships and friendships are improving. You should also start to feel more in control of your thoughts and behaviors.",
                    "Days 29-35 – You should be feeling really good and may even experience a “natural high.” You’re almost halfway through the challenge by now, and your confidence should be increasing. You’ll feel more energetic, but the urges can be stronger during this time too. Remember that NoBeep will help you to become a better person, and you’ll start to respect others more, making you even more attractive.",
                    "Days 36-42 – This stage can be the toughest, as you may experience a roller coaster of highs and lows. You may also feel unusually tired and anxious. If you find yourself struggling, take it one day at a time. Remember that you have the strength and courage to make it through this challenge. 💪⏳"
                ],
                "3": [
                    "Here are some of the improvements you can expect to see:",
                    "Increased self-awareness and a desire to become the best version of yourself.",
                    "A newfound ability to focus and concentrate on tasks with ease.",
                    "A stronger will to stay the course and accomplish your goals.",
                    "A newfound appreciation for the female gender and a desire to treat them with respect."
                ],
                "4": [
                    "Each person's recovery timeline is unique, and it is important to remember that the process of healing is different for everyone. You may experience any of the following: despair, mood swings, difficulty concentrating, a lack of interest in activities you used to enjoy, lethargy, feelings of hopelessness or helplessness, insomnia, confusion, doubt, and/or changes in appetite or weight",
                    "It's normal to feel overwhelmed, but if you take it one day at a time, you'll soon begin to see progress 💪."
                ]
            },
            "youtube": [
                {
                    "video_id": "q96Hz_eeD8M",
                    "video_title": "#1 Way to Fight the Urge to Watch Pornography. (with Dr. Trish Leigh)",
                    "video_author": "Dr. Trish Leigh, P*rn Brain Rewire"
                },
                {
                    "video_id": "-YidoIjYVyM",
                    "video_title": "NoFap (Batman Edition)",
                    "video_author": "Trajan"
                },
                {
                    "video_id": "AuSqrzAhcJ4",
                    "video_title": "The Dark Secrets of the Social Media Circus",
                    "video_author": "SANQ4"
                }
            ]
        },
        "5": {
            "timeline_id": "5",
            "timeline_lable": "WEEK 7-11",
            "timeline_day_lb": "43",
            "timeline_day_ub": "77",
            "timeline_set": {
                "1": [
                    "This stage of the NoBeep Challenge is typically full of progress. During this stage, you can begin to appreciate the rewards of putting in the effort and the old habits, such as viewing pornography or indulging in porn-related activities, no longer have the same power over you."
                ],
                "2": [
                    "Days 43-60 - During this time, you'll start to see a boost in your energy and motivation, as well as an increase in your libido or sex drive. You'll likely feel confident enough to take on social situations or start dating. Plus, your sex life has improved because now you're more focused on your partner, or if you don't have one, you may feel an urge to find someone special.",
                    "Days 61-77 - During these days, you may notice a significant spike in your testosterone levels. Plus, males usually feel much better overall and enjoy the direction their lives are taking. And if you're in a relationship, the spark may be reignited. Alternatively, if you're single, you may feel ready to start dating again.",
                    "No matter where you are in the process, remember to stay focused and continue to make progress. Achieving true recovery takes time and dedication, but with the right methods and attitude, you can make it happen. 💪"
                ],
                "3": [
                    "Here are a few of the most common benefits you can expect to see:",
                    "More energy and motivation - you’ll start to feel less drained and more driven to take on new tasks and projects.",
                    "Clearer thinking - you’ll notice less “brain fog” and be better able to focus on what you need to do.",
                    "Improved relationships - you’ll be better able to connect with others and enjoy healthy, meaningful relationships.",
                    " Greater happiness and contentment - as your brain begins to heal, you’ll discover a newfound sense of joy and satisfaction in life.",
                    "Higher self-confidence - you’ll start to feel more secure in yourself and better able to take on new challenges",
                    "A deeper, more powerful voice - your speech will become more authoritative and you’ll be more comfortable speaking up for yourself."
                ],
                "4": [
                    "If you’re feeling the temptation to relapse, it’s important to be proactive in your recovery. While relapses are common and expected, you can still take steps to combat them. One way to do this is to set a timeline for yourself and track your progress. Set realistic goals, such as days or even weeks without indulging in porn or masturbation, and reward yourself for achieving them. Additionally, to keep yourself on track, don’t be afraid to use reminders and other accountability tactics. And lastly, don’t forget to take time to practice self-care and relaxation—these things can go a long way in helping you stay the course. 💪"
                ]
            },
            "youtube": [
                {
                    "video_id": "_ICREZm9CtE",
                    "video_title": "BEFORE YOU OVERTHINK, WATCH THIS (2023)",
                    "video_author": "Prince Ea"
                },
                {
                    "video_id": "wXsxwIJnUJk",
                    "video_title": "10 Mind-Blowing Benefits of Meditation",
                    "video_author": "TopThink"
                },
                {
                    "video_id": "yyktccr5apU",
                    "video_title": "The Dark World of New Age Gurus | Documentary.",
                    "video_author": "James Jani"
                }
            ]
        },
        "6": {
            "timeline_id": "6",
            "timeline_lable": "DAYS 78-90",
            "timeline_day_lb": "78",
            "timeline_day_ub": "90",
            "timeline_set": {
                "1": [
                    "During these days, most people in recovery from porn or sex addiction experience a noticeable boost in testosterone levels. Additionally, most people report feeling better overall. They feel a sense of purpose and direction in their lives."
                ],
                "2": [
                    "You can now look back with pride at the progress you have made since you decided to take control of your life and make a commitment to recovery. Instead of feeling shame and guilt, you can recognize the strength and courage it took to make a change. And you can celebrate the steps you have taken to free yourself from the harms of porn use and masturbation.",
                    "You have come a long way and you deserve to be proud of the effort you have put in to make a positive change. As you continue on your journey, you will likely experience a range of emotions - including joy, pride, and accomplishment - as you reach each milestone."
                ],
                "3": [
                    "Here are some of the changes you can expect:",
                    "Your vision of how you want your future to be will become more clear. You’ll also notice less brain fog.",
                    "You’ll start to feel an increase in clarity as you gain a better vision of your goals.",
                    "You may experience an increase in stress for a few weeks, as you’re making a lifestyle change. Your anger levels may also increase.",
                    "You’ll begin to feel more productive, and you may start to notice people noticing you more."
                ],
                "4": [
                    "If you’re feeling the temptation to relapse, it’s important to be proactive in your recovery. While relapses are common and expected, you can still take steps to combat them. One way to do this is to set a timeline for yourself and track your progress. Set realistic goals, such as days or even weeks without indulging in porn or masturbation, and reward yourself for achieving them. Additionally, to keep yourself on track, don’t be afraid to use reminders and other accountability tactics. And lastly, don’t forget to take time to practice self-care and relaxation—these things can go a long way in helping you stay the course. 💪"
                ]
            },
            "youtube": [
                {
                    "video_id": "dbYWKVAeu6Y",
                    "video_title": "Escaping Porn Addiction | Eli Nash | TEDxFortWayne",
                    "video_author": "TEDx Talks"
                }
            ]
        },
        "7": {
            "timeline_id": "7",
            "timeline_lable": "DAYS 90+",
            "timeline_day_lb": "91",
            "timeline_day_ub": "99999",
            "timeline_set": {
                "1": [
                    "Congratulations🔥",
                    "You have made it!!"
                ],
                "2": [
                    "Porn or sex addiction is an addiction, and just like any other addiction, it involves more than just quitting and the feeling of being 'cured'",
                    "If you decide to allow yourself to indulge in porn or sex once a week, you’ll start looking forward to that one day every week and this may lead to a relapse in the long run.",
                    "The goal here was to help you stay fap/Beep free and show that it is possible to live a life without having to rely on porn or sex as a source of satisfaction."
                ],
                "3": [
                    "Research suggests that it takes at least a year for the brain to reboot and get back to normal after an addiction. Even after that, it is possible to relapse if the underlying issues causing the addiction are not addressed.",
                    "So, if you are serious about your recovery, the best approach is to commit to the process for the long-term."
                ],
                "4": [
                    "We hope this information helps you on your journey towards recovery. Good luck!"
                ]
            },
            "youtube": [
                {
                    "video_id": "XbhecuoEgxs",
                    "video_title": "Kung Fu Panda | Who Are You",
                    "video_author": "Khaled Osman"
                }
            ]
        }
    }
}